tgi/turing_machinen.html
---
layout: page
title: Turing_machinen
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Turing Machinen</h2>
<div class="outline-text-2" id="text-1">
<p>
Eine Turing Machine (TM) ist ein 7-Tupel
\((Q,\Sigma,\Gamma,\delta,q_0,q_{acc},q_{rej})\) aus:
</p>

<ul class="org-ul">
<li>einer endliche Zustandsmenge \(Q\),
</li>
<li>einem <i>Eingabealphabet</i> \(\Sigma\), mit
\(\textvisiblespace \not\in \Sigma\),
</li>
<li>einem <i>Arbeitsalphabet</i> \(\Gamma\) mit
\(\Sigma \cup \{\textvisiblespace\} \subseteq \Gamma\) und
\(Q \cap \Gamma = \emptyset\),
</li>
<li>einer Transitionsfunktion
\(\delta: Q\setminus\{q_{acc},q_{rej}\} \times \Gamma \rightarrow Q \times \Gamma \times \{L,R\}\),
(\(L\): gehe nach links auf dem Band, \(R\): gehe nach rechts auf dem
Band),
</li>
<li>einem <i>Startzustand</i> \(\q_0 \in Q\),
</li>
<li>einem <i>akzeptierender Zustand</i> \(\q_{acc} \in Q\) und
</li>
<li>einem <i>verwerfender Zustand</i> \(q_{rej} \in Q\) mit
\(q_{reject} \neq q_{acc}\).
</li>
</ul>

<p>
Das Band ist <i>linksbeschränkt</i>, d.h., wenn der Schreib-/Lesekopf an der
linkesten Position ist und nach links geht verändert der
Schreib-/Lesekopf seine Position nicht. Markiere den Bandanfang durch
ein \(\textvisiblespace\).
</p>

<p>
<b>Alternativen zur formalen Beschreibung einer TM:</b>
</p>

<ul class="org-ul">
<li>informelle Beschreibung (Fließtext, Flow-Chart oder Pseudocode mit
Bezug zur Implementierung der TM). Gängige Formulierungen sind dabei:

<ul class="org-ul">
<li><i>in der endlichen Kontrolle merken</i>: ein Zustand für jedes Objekt
von Interesse erzeugt.
</li>
<li><i>markieren:</i> Es wird ein Arbeitsaphabet aus Tupeln erzeugt, wobei
ein Element des Tupels zur Markierung mit Hilfe der Werte \(0\) und
\(1\) genuzt wird, z.B. Tupel \((a,1)\) und \((a,0)\)
</li>
</ul>
</li>

<li>graphische Beschreibung (gleichwertig zur formalen Beschreibung)
</li>
<li>high-level Beschreibung
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Konfigurationen</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>Anfangskonfiguration</b> zu \(w \in \Sigma^*\): \(q_0w\), falls
\(w \neq \epsilon\), sonst \(q_0\textvisiblespace\).
</p>

<p>
<b>Haltekonfiguration</b> zu \(u,v \in \Sigma^*\): \(u q_{acc}v\) und
\(u q_{rej}v\).
</p>

<p>
<b>Folgekonfiguration</b> zu \(u q av\) für \(q\not\in\{q_{acc},q_{rej}\}\):
</p>

<ul class="org-ul">
<li>falls \(\delta(q,a) = (q',b,R)\) und \(v \neq \epsilon\) dann ist die
Folgekonfiguration \(ub q'v\)
</li>
<li>falls \(\delta(q,a) = (q',b,R)\) und \(v = \epsilon\) dann ist die
Folgekonfiguration \(ub q'\textvisiblespace\)
</li>
<li>falls \(\delta(q,a) = (q',b,L)\) und \(u = \epsilon\) dann ist die
Folgekonfiguration \(q'bv\)
</li>
<li>falls \(\delta(q,a) = (q',b,L)\) und \(u = u'c\) dann ist die
Folgekonfiguration \(u'q'cbv\)
</li>
</ul>

<p>
Falls \(q = q_{acc}\) oder \(q = q_{rej}\) gilt gibt es <i>keine</i>
Folgekonfiguration, d.h. es gibt keine Transitionen aus \(q_{acc}\) oder
\(q_{rej}\) in andere Zustände!
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Berechnung</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Eine Berechnung zu \(w\in\Sigma^*\) ist eine Folge von Konfigurationen
\((\kappa_0,\kappa_1,\kappa_2,\dots)\) mit folgenden Eigenschaften:
</p>

<ol class="org-ol">
<li>\(\kappa_0\) ist Anfangskonfiguration zu \(w\)
</li>
<li>wenn \(\kappa_i\) definiert ist und eine Folgekonfiguration besitzt,
dann ist \(\kappa_{i+1}\) diese Folgekonfiguration.
</li>
</ol>

<p>
Es gibt also unendliche Berechnungen.
</p>

<p>
Wir schreiben auch
\(q_0 W \vdash u_1 q_1 v_1 \vdash u_2 q_2 v_2 \vdash \dots\)
</p>

<p>
Eine TM <i>akzeptiert</i> eine Wort \(w\), falls die Berechnung zu \(w\) endlich
ist und die letzte Konfiguration eine akzeptierende Haltekonfiguration
ist.
</p>

<p>
Eine TM <i>verwirft</i> eine Wort \(w\), falls die Berechnung zu \(w\) endlich
ist und die letzte Konfiguration eine verwerfende Haltekonfiguration
ist.
</p>

<p>
Eine TM <i>erkennt</i> die Sprache der Wörter, die sie akzeptiert. (Merke
jede TM erkennt <i>genau</i> eine Sprache)
</p>

<p>
Eine TM <i>entscheidet</i> eine Sprache \(L \subseteq \Sigma^*\), falls sie
jedes Wort \(w \in L\) akzeptiert und jedes Wort
\(w \in \Sigma^*\setminus L\) verwirft (statt entscheiden sagt man auch
<i>rekursiv aufzählbar</i> oder <i>positiv semientscheidbar</i>).
</p>

<p>
Eine Sprache ist <i>Turingerkennbar</i>, falls es eine TM gibt, die sie
erkennt
</p>

<p>
Eine Sprache ist (Turing-)/Entscheidbar/ (man sagt auch
<i>Turing-berechnbar</i>, falls es eine TM gibt, die sie entscheidet.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Varianten von Turingmachinen</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Es gibt ganz viele Variante von Turingmachinen. Alle führen jedoch zu
demselben Entscheidbarkeits- und Erkennbarkeitsbegriff.
</p>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Mehrband Turingmachinen</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Eine \(k\)-Band-TM (auch <i>Mehrband</i> TM, kurz MTM) mit \(k \geq 1\):
\((Q,\Sigma,\Gamma,\delta,q_0,q_{acc},q_{rej})\) mit
</p>

<ul class="org-ul">
<li>\(\delta:Q \times \Gamma^k \rightarrow Q \times \Gamma^k \times \{L,R,S\}^k\)
   (\(S\): bleibe stehen)
</li>
</ul>

<p>
<b>Eigenschaften:</b>
</p>

<ul class="org-ul">
<li>Jede \(k\)-Band-TM ist äquivalent zu einer 1-Band-TM.
</li>
<li>Jede 1-Band-TM ist äquivalent zu einer TM.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Nicht-deterministische Turing Machinen</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
<i>nicht-deterministische</i> TM (NTM)
\((Q,\Sigma,\Gamma,\delta,q_0,q_{acc},q_{rej})\) mit:
</p>

<ul class="org-ul">
<li>\(\delta: Q \times \Gamma \rightarrow \mathcal{P}(Q\times \Gamma \times \{L,R\})\)
</li>
</ul>

<p>
NTM sind komplizierter als TM, weil es für ein Wort sowohl:
</p>

<ul class="org-ul">
<li>eine akzeptierende Berechnung
</li>
<li>eine verwerfende Berechnung,
</li>
<li>eine haltende, aber weder akzeptierende noch verwerfende Berechnung
und
</li>
<li>eine nicht haltende Berechnung
</li>
</ul>

<p>
geben kann.
</p>

<p>
Die von einer NTM erkannte Sprache besteht aus allen Wörtern, für die
die NTM <i>mindestens</i> eine akzeptierende Berechnung besitzt.
</p>

<p>
Eine NTM entscheidet eine Sprache, falls
</p>

<ul class="org-ul">
<li>sie nur endliche (terminierende) Berechnungen besizt.
</li>
<li>sie die Sprache erkennt.
</li>
</ul>

<p>
<b>Eigenschaften:</b>
</p>

<ul class="org-ul">
<li>Zu jeder NTM gibt es eine mehrband TM, welche dieselbe Sprache
erkennt.
</li>
<li>Zu jeder NTM gibt es eine TM \(T\), die dieselbe Sprache erkennt und
ggf. entscheidet.
</li>
<li>Jede NTM kann in eine äquivalente NTM (erkennt und entscheidet ggf.
dieselbe Sprache) mit Grad des Nichtdeterminismus 2 (d.h.
\(\forall q \in Q, a \in \Gamma: |\delta(q,a)| = 2\)) überführt werden.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> aufzählende TM</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Eine aufzählende TM ist eine 2-Band TM mit
</p>

<ol class="org-ol">
<li>Wenn es sich um eine TM handelt, die eine eine Sprache über dem
Alphabet \(\Sigma\) aufzählen soll, dann gilt
\(\Sigma \cup \\{\textvisiblespace\\} \cup \\{\\#\\} \subset \Gamma\).
</li>
<li>Für die Transitionsfunktion gilt
\(\delta: Q \times \Gamma^2 \rightarrow Q \times \Gamma \times (\Sigma \cup \\{\textvisiblespace\\} \cup \\{\\#\\}) \times \{L,R,S\} \times \{R,S\}\).
Auf dem zweiten Band darf nicht gelöscht werden, da. falls
\(\delta(q,a,b) = (q',a',b',d,S)\) gilt, dann gilt
\(b=b'=\textvisiblespace\). Falls \(\delta(q,a,b) = (q',a',b',d,R)\)
gilt, dann gilt \(b\neq \textvisiblespace\). Somit entsteht auf Band
zwei von links nach rechts ein Wort der Form \(u_0\\#u_1\\#\dots\) mit
\(u_i \in \Sigma^{\*}\) entsteht.
</li>
<li>Die aufzählende TM startet immer mit leerer Eingabe.
</li>
</ol>

<p>
Die von der TM aufgezählten Sprache enthält die \(u_i\)'s.
</p>

<p>
<b>Eigenschaften:</b>
</p>

<ul class="org-ul">
<li>Eine Sprache ist genau dann erkennbar, wenn sie aufzählbar ist.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Äquivalenz</h3>
<div class="outline-text-3" id="text-1-4">
<p>
TMen heißen <i>äquivalent</i>, wenn sie dieselben Sprachen erkennen und
dieselben Sprachen entscheiden, falls min. eine Sprache entschieden
wird.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Church-Turing-These</h2>
<div class="outline-text-2" id="text-2">
<p>
Der intuitive Entscheidbarkeitsbegriff stimmt mit dem formalen Begriff
der <i>Turing-Entscheidbarkeit</i> überein.
</p>

<p>
Die These ist notwendig, um nachzuweisen, dass eine gegebenes Problem
nicht entscheidbar ist. Es wird allgemein angenommen, dass die These
stimmt, obwohl sie nicht beweisbar ist, da der "intuitive
Entscheidbarkeitsbegriff" nicht formal definiert ist.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Codierung</h2>
<div class="outline-text-2" id="text-3">
<p>
Um Mit Hilfe von TM Aussagen über interessante Objekte (z.B. Zahlen,
Funktionen, Graphen, etc.) treffen zu können, müssen diese Objekte als
Wörter einer Sprache codiert werden (Beispiele für Codierungen s.
Vorlesung vom 12.01.16).
</p>

<p>
<b>Konvention:</b>
</p>

<ul class="org-ul">
<li>Wir schreiben \(\langle O \rangle\) für die Codierung des Objektes \(O\).
</li>
<li>Wir schreiben
\(\langle O_0, O_1 \rangle := (\langle O_0 \rangle , \langle O_1 \rangle)\)
für die Codierung zweier Objekte \(O_0\) und \(O_1\) in Form eines Paars
von Codierungen.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Beispiele für interessante Probleme</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Gehört Wort \(w\) zur Sprache \(G\)? Probleme dieser Art heißen
<b>Wortprobleme</b>. Wir definieren \(A_x\) oder \(ACC_x\) als die Sprache der
Codierungen für Sprachkategorie \(x\), z.B.
$A<sub>CFG</sub> := \{\langle G, w \rangle | \text{\(G\) ist CFG und \(G\) erzeugt $w$} \}$
</li>
<li>Ist die erzeugte Sprache leer? Probleme dieser Art heißen
<b>Leerheitsprobleme</b>, kurz \(E_x\) oder \(EMPTY_x\) für Sprachkategorie
\(x\). Das Leerheitsproblem für CFG ist also
$E<sub>CFG</sub> := \{\langle G\rangle | \text{\(G\) ist CFG und \(G\) erzeugt kein Wort} \}$
</li>
<li>Sind zwei Objekte äquivalent? Probleme dieser Art heißen
<b>Äquivalenzprobleme</b>. Das Äquivalenzproblem für CFG ist also
$EQ<sub>CFG</sub> := \{\langle G<sub>0</sub>, G<sub>1\rangle</sub> | \text{\(G_0\) und \(G_1\) sind CFG und \(G_0\) erzerzeugt dieselbe Sprache wie $G_1$} \}$
</li>
<li>Akzeptiert ein Objekt alle Wörter, die mit einem gegbenen Alphabet
konstruiert werden können? Probleme dieser Art heißen
<b>Universalitätsproblem</b>. Wir definieren
\(UNIV_x := \{\langle u \rangle | u \text{ist x und akzeptiert alle Wörter über dem gegebenen Alphabet} \}\).
Also z.B.
\(UNIV_{CFG} = \{\langle G \rangle | G \text{ ist CFG und} L(G) = \Sigma^*\}\).
</li>
</ul>

<p>
Probleme können
</p>

<ul class="org-ul">
<li>entscheidbar sein (ent)
</li>
<li>erkennbar aber nicht entscheidbar (erk)
</li>
<li><i>co-erkennbar</i>, d.h. das Komplement ist erkennbar (coerk)
</li>
<li>nicht <i>co-erkennbar</i>, d.h. das Komplement ist nicht erkennbar (coerk)
</li>
<li>nicht erkennbar (nerk)
</li>
</ul>

<p>
Es gilt: \(L\) erkannbar und co-erkennbar, genau dann, wenn \(L\)
entscheidbar.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">DFA</th>
<th scope="col" class="left">NFA</th>
<th scope="col" class="left">REX</th>
<th scope="col" class="left">DPDA</th>
<th scope="col" class="left">CFG</th>
<th scope="col" class="left">PDA</th>
<th scope="col" class="left">TM</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">A</td>
<td class="left">ent</td>
<td class="left">ent</td>
<td class="left">ent</td>
<td class="left">ent</td>
<td class="left">ent</td>
<td class="left">ent</td>
<td class="left">nent, erk, ncoerk</td>
</tr>

<tr>
<td class="left">E</td>
<td class="left">ent</td>
<td class="left">ent</td>
<td class="left">ent</td>
<td class="left">ent</td>
<td class="left">ent</td>
<td class="left">ent</td>
<td class="left">nent, nerk, coerk</td>
</tr>

<tr>
<td class="left">EQ</td>
<td class="left">ent</td>
<td class="left">ent</td>
<td class="left">ent</td>
<td class="left">ent</td>
<td class="left">nent, nerk, coerk</td>
<td class="left">ner</td>
<td class="left">nent, nerk, ncoerk</td>
</tr>

<tr>
<td class="left">UNIV</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">nent</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
\(NON-EMPTY_{TM} := \{\langle M \rangle | M \text{ ist TM und } M \text{akzeptiert mindestens ein Wort} \}\)
enrkennbar, aber nicht entscheidbar.
</p>

<p>
*Beweisschema um zu zeigen, dass ein gegebenes Problem nicht
entscheidbar ist (d.h. die Sprache der Codierungen dieses Problems ist
nicht Turing-entscheidbar):*
</p>

<p>
Beweis durch Widerspruch: Nimm an, dass es eine TM gibt, die das
gegebene Problem entscheidet und konstruiere mit Hilfe dieser TM eine
TM, die \(A_{TM}\) oder \(E_{TM}\) entscheidet. Das ist ein Widerspruch, da
\(A_{TM}\) und \(E_{TM}\) bekanntermaßen nicht entscheidbar sind (Meist
verwendet man \(A_{TM}\), da sie die einfachste der nicht entscheidbaren
Sprachen ist).
</p>

<p>
*Beweisschema um zu zeigen, dass ein gegebenes Problem welches nichts
mit Turing Machinen zu tun hat (z.B. CFG) nicht entscheidbar ist (d.h.
die Sprache der Codierungen dieses Problems ist nicht
Turing-entscheidbar):*
</p>

<p>
Arbeite mit Berechnungen (genauer gesagt mit Codierungen von
Berechnungen) von Turing Machinen.
</p>

<p>
Z.B. \(UNIV_CFG\): Stelle eine Beziehung folgender Form her: Eine TM \(T\)
akzeptiert ein Wort (nicht) \(w\) genau dann wenn \(L(G) = \Sigma^*\) gilt.
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Dominoproblem</h3>
<div class="outline-text-3" id="text-4-1">
<p>
$DOMINO = \{\langle S,K \rangle \mid S \text{ist endlicher Satz von Kacheln, \(K \in S\) mit \(S\) lässt sich ausgehend von \(K\), der erste Quadrant parkettieren}\}$
</p>

<p>
Dominoprobleme sind unentscheidbar.
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Polynomprobleme</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Es ist nicht entscheidbar, ob ein Polynom mit mindestens 26 Variablen
eine ganzzahlige Nullstelle besitzt.
</p>
</div>
</div>
</div>
